[
  {
    "title": "Como Crear una pagina.",
    "description": "Se recomienda que utilice el navegador Google Chrome o Firefox para una mejor experiencia de lectura.",
    "url": "/3/"
  },
  {
    "title": "Usando Páginas como Diálogos (JQueryMobile)",
    "description": "Un cuadro de diálogo es un tipo de ventana que se utiliza para mostrar información especial o solicitar una entrada.",
    "url": "/4/"
  },
  {
    "title": "Transiciones con ventanas",
    "description": "jQuery Mobile incluye efectos CSS3 que te permiten elegir la forma en que debería abrirse una página.\njQuery Mobile tiene una variedad de efectos sobre cómo hacer la transición de una página a la siguiente.",
    "url": "/5/"
  },
  {
    "title": "Botones en JQuery Mobile",
    "description": "Las aplicaciones móviles se basan en la simplicidad de tocar las cosas que desea mostrar.",
    "url": "/6/"
  },
  {
    "title": "Iconos de botones",
    "description": "jQuery Mobile proporciona un conjunto de iconos que harán que tus botones se vean más bonitos.",
    "url": "/7/"
  },
  {
    "title": "Ventanas Popups",
    "description": "Los elementos emergentes son similares a los diálogos, ya que ambos se superponen a una parte de una página. Un cuadro emergente puede ser útil cuando desea mostrar texto pequeño, fotos, mapas u otro contenido.",
    "url": "/8/"
  },
  {
    "title": "Posicionamiento de ventanas emergentes",
    "description": "Por defecto, las ventanas emergentes aparecerán directamente sobre el elemento pulsado. Para controlar la posición de la ventana emergente, use el atributo de posición de datos en el enlace que se usa para abrir la ventana emergente.",
    "url": "/9/"
  },
  {
    "title": "Transiciones en Popus",
    "description": "Por defecto, las ventanas emergentes no tienen efectos de transición añadidos. Puede utilizar cualquiera de los efectos que presentamos en el capítulo 'Transiciones'.",
    "url": "/10/"
  },
  {
    "title": "Ventanas con punta de flecha",
    "description": "Para agregar una flecha al borde de la ventana emergente, use el atributo data-arrow=' ' y especifique el valor 'l' (izquierda), 't' (arriba), 'r' (derecha) o 'b' (abajo)",
    "url": "/11/"
  },
  {
    "title": "Diálogos emergentes o modales",
    "description": "Puede agregar una marca de diálogo estándar en una ventana emergente (encabezado, contenido y marca de pie de página)",
    "url": "/12/"
  },
  {
    "title": "Fotos popup",
    "description": "También puede mostrar imágenes en una ventana emergente",
    "url": "/13/"
  },
  {
    "title": "Superposición de ventanas emergentes",
    "description": "Puede controlar el color de fondo detrás de la ventana emergente (la página en sí) con el atributo data-overlay-theme.",
    "url": "/14/"
  },
  {
    "title": "Barra de herramientas",
    "description": "Los elementos de la barra de herramientas a menudo se colocan dentro de los encabezados y pies de página, para una navegación de 'fácil acceso'",
    "url": "/15/"
  },
  {
    "title": "Barra de Herramientas en Pie Página",
    "description": "El pie de página se encuentra en la parte inferior de la página.\nEl pie de página es más flexible que el encabezado: es más funcional y se puede cambiar en todas las páginas, por lo que puede contener tantos botones como sea necesario",
    "url": "/16/"
  },
  {
    "title": "Posicionando encabezados y pies de página",
    "description": "Use el atributo de posición de datos para posicionar sus encabezados y pies de página",
    "url": "/17/"
  },
  {
    "title": "Mostrando solo iconos en la Barra de Herramientas",
    "description": "Utilizando la clase ui-btn-icon-notext para mostrar solo el icono en los botones de encabezado y pie de página",
    "url": "/18/"
  },
  {
    "title": "Barras de navegación",
    "description": "Una barra de navegación consiste en un grupo de enlaces que se alinean horizontalmente, generalmente dentro de un encabezado o pie de página.",
    "url": "/19/"
  },
  {
    "title": "Barras de navegación con iconos",
    "description": "Para agregar un ícono a su botón de navegación, use el atributo data-icon",
    "url": "/20/"
  },
  {
    "title": "Posicionamiento de iconos en la Barra de Navegación",
    "description": "Al igual que con la clase 'ui-btn-icon- position' (especificada en el capítulo 'Iconos'), puede elegir dónde se debe colocar el icono en el botón de navegación: arriba, derecha, abajo o izquierda.",
    "url": "/21/"
  },
  {
    "title": "Botones Activos",
    "description": "Cuando se toca / hace clic en un enlace en la barra de navegación, se obtiene el aspecto seleccionado (presionado).\nPara lograr este aspecto sin tener que tocar el enlace, use la class = 'ui-btn-active'.",
    "url": "/22/"
  },
  {
    "title": "Barras de Navegación en el contenido",
    "description": "Se puede colocar barras de navegación en el contenido.\nTambién se puede agregar en el pie de pagina.",
    "url": "/23/"
  },
  {
    "title": "Paneles en Query Mobile",
    "description": "Los paneles en jQuery Mobile se deslizarán desde el lado izquierdo o derecho de la pantalla con contenido adicional.",
    "url": "/24/"
  },
  {
    "title": "Visualización de Paneles",
    "description": "Puede controlar el modo de visualización del panel con el atributo de visualización de datos",
    "url": "/25/"
  },
  {
    "title": "Posicionamiento de Panel con respecto al contenido",
    "description": "También puede especificar cómo se debe colocar el contenido del panel de acuerdo con el resto de la página cuando un usuario comienza a desplazarse. De forma predeterminada, el panel se desplazará con la página (pero el contenido del panel permanecerá en la parte superior de la página).",
    "url": "/26/"
  },
  {
    "title": "Elementos Colapsables o Desplegables",
    "description": "Los elementos plegables le permiten ocultar o mostrar contenido, lo cual es útil para almacenar partes de información.",
    "url": "/27/"
  },
  {
    "title": "Ventana Emergente con Contenido en Acordeón",
    "description": "Se puede crear una ventana Popup (emergente) con contenido en acordeon.",
    "url": "/28/"
  },
  {
    "title": "Eliminar esquinas redondeadas en los desplegables o acordeones",
    "description": "Cómo eliminar las esquinas redondeadas y agregar un ancho completo en los elementos plegables, usando data-inset.",
    "url": "/29/"
  },
  {
    "title": "Como hacer más pequeños los elementos desplegables o acordeon",
    "description": "Cómo hacer más pequeños los elementos plegables.",
    "url": "/30/"
  },
  {
    "title": "Cambio del icono con el icono de datos contraídos y el icono de datos expandidos",
    "description": "Cómo cambiar el icono de los elementos plegables (el valor predeterminado es + y -).",
    "url": "/31/"
  },
  {
    "title": "Tablas Responsivas",
    "description": "El diseño responsivo es útil cuando desea que el contenido de su página web móvil responda al dispositivo del usuario, como su tamaño de pantalla y orientación.",
    "url": "/32/"
  },
  {
    "title": "Grids",
    "description": "jQuery Mobile proporciona un conjunto de diseños de columnas basados ​​en CSS. Sin embargo, los diseños de columnas generalmente no se recomiendan en un dispositivo móvil, debido al ancho de la pantalla del dispositivo móvil.\nPero hay ocasiones en las que desea colocar elementos más pequeños, como botones o pestañas de navegación, lado a lado como si estuviera en una tabla. Entonces, las columnas son perfectas.",
    "url": "/33/"
  },
  {
    "title": "List Views",
    "description": "Las vistas de lista en jQuery Mobile son listas HTML estándar; ordenado 'ol' y desordenado 'ul'.",
    "url": "/34/"
  },
  {
    "title": "Listas de solo lectura",
    "description": "Para mostrar listas de solo lectura omitir agregar ligas, en cada elemento 'li'.",
    "url": "/35/"
  },
  {
    "title": "Cómo insertar paneles en los elementos de su lista",
    "description": "Cómo insertar paneles en los elementos de su lista.",
    "url": "/36/"
  },
  {
    "title": "Lista con iconos",
    "description": "El icono predeterminado para cada elemento de la lista que contiene un enlace es 'carat-r' (flecha derecha).",
    "url": "/37/"
  },
  {
    "title": "Botones divididos en las listas",
    "description": "jQuery Mobile colocará automáticamente el segundo enlace en el lado derecho de la lista con un icono de flecha derecha. Y el texto dentro del enlace (si lo hubiera) se mostrará cuando un usuario se desplace sobre el icono",
    "url": "/38/"
  },
  {
    "title": "Funcionalidad con botones divididos",
    "description": "Se permite agregar algunas páginas y cuadros de diálogo para que los enlaces sean más funcionales",
    "url": "/39/"
  },
  {
    "title": "Burbujas de conteo",
    "description": "Las burbujas de recuento se utilizan para mostrar números asociados con elementos de lista, como mensajes en un buzón.\nPara agregar burbujas de conteo, use un elemento en línea, como 'span', con la clase 'ui-li-count' y agregue un número.",
    "url": "/40/"
  },
  {
    "title": "Como crear listas emergentes",
    "description": "Cómo crear una lista emergente.",
    "url": "/41/"
  },
  {
    "title": "Listas desplegables",
    "description": "Cómo crear listas que ocultan y muestran contenido.",
    "url": "/42/"
  },
  {
    "title": "Lista Desplegable desplegable",
    "description": "Cómo crear una lista desplegable.",
    "url": "/43/"
  },
  {
    "title": "Elementos Filtreables",
    "description": "Todos los elementos que tienen más de un elemento hijo, pueden ser filtrados.",
    "url": "/44/"
  },
  {
    "title": "Filtrar listas desplegables",
    "description": "Cómo filtrar un conjunto plegable de listas.",
    "url": "/45/"
  },
  {
    "title": "Tablas filtreables",
    "description": "Cómo filtrar una tabla.",
    "url": "/46/"
  },
  {
    "title": "Filtrar elemento div con elementos",
    "description": "Cómo filtrar un elemento 'div' que contiene elementos 'p' secundarios.",
    "url": "/47/"
  },
  {
    "title": "Formularios",
    "description": "jQuery Mobile crea estilos HTML de forma automática para que se vean atractivos y fáciles de usar(touch-friendly).",
    "url": "/48/"
  },
  {
    "title": "Contenedores de Formularios",
    "description": "Para hacer que las etiquetas y los elementos de formulario se vean correctamente en pantallas más anchas, coloquenlos dentro de un elemento 'div' o 'fieldset' con la clase 'ui-field-contener' alrededor del elemento label / form.",
    "url": "/49/"
  },
  {
    "title": "Elementos de entrada de Formularios",
    "description": "Los campos de entrada están codificados con elementos HTML estándar, y jQuery Mobile los diseñará para que se vean atractivos y fáciles de usar para dispositivos móviles. También puede usar los nuevos tipos de HTML5 'input'.",
    "url": "/50/"
  },
  {
    "title": "Formularios en Popup",
    "description": "También puede colocar su formulario dentro de una ventana emergente.",
    "url": "/51/"
  },
  {
    "title": "Menu Select",
    "description": "El elemento 'select' crea una lista desplegable con varias opciones. Los elementos 'option' dentro del elemento 'select' definen las opciones disponibles en la lista.",
    "url": "/52/"
  },
  {
    "title": "Menús select personalizados",
    "description": "Las plataformas móviles tienen su propia forma de mostrar un menú de selección.\nSi desea que el menú de selección muestre lo mismo en todos los dispositivos móviles, use el menú de selección personalizado de jQuery, el atributo data-native-menu = 'false'.",
    "url": "/53/"
  },
  {
    "title": "Control Group con Select Menu",
    "description": "Cómo agrupar uno o más menús de selección.",
    "url": "/54/"
  },
  {
    "title": "Control Group HORIZONTAL con Select Menu",
    "description": "Cómo agrupar los menús de selección horizontalmente.",
    "url": "/55/"
  },
  {
    "title": "Control Group PRESELECCIONAR OPCIÓN con Select Menu",
    "description": "Cómo preseleccionar una opción.",
    "url": "/56/"
  },
  {
    "title": "Control Group SELECCIONAR en POPUP con Select Men",
    "description": "Cómo crear un menú de selección emergente.",
    "url": "/57/"
  },
  {
    "title": "Control Group Menu Colapsable",
    "description": "Cómo crear formularios plegables.",
    "url": "/58/"
  },
  {
    "title": "Uso de Slider",
    "description": "A slider te permite seleccionar un valor de un rango de valores.",
    "url": "/59/"
  },
  {
    "title": "Uso de Flip Toggle Switch ",
    "description": "Un interruptor giratorio se usa a menudo para los botones de encendido / apagado o verdadero / falso.",
    "url": "/60/"
  },
  {
    "title": "Uso de DOBLE Flip Toggle Switch",
    "description": "Uso de DOBLE Flip Toggle Switch",
    "url": "/61/"
  },
  {
    "title": "Hacer Flip Toggle Switch MAS ANCHO",
    "description": "Cómo hacer que el flip switch sea más ancho.",
    "url": "/62/"
  },
  {
    "title": "Usar Temas en las paginas",
    "description": "jQuery Mobile proporciona dos temas de estilo diferentes, 'a' y 'b', cada uno con diferentes colores para botones, barras, bloques de contenido, etc.",
    "url": "/63/"
  }
]
